Revit 2027 API
PolymeshTopology.GetFacet Method
 Returns a definition of one facet
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PolymeshFacet GetFacet(
	int idx
)
Public Function GetFacet (
	idx As Integer
) As PolymeshFacet
public:
PolymeshFacet^ GetFacet(
	int idx
)
member GetFacet :
        idx : int -> PolymeshFacet
Parameters
idx Int32
 A zero-based index of the facet
Return Value
PolymeshFacet
 An instance of PolymeshFacet that represents one facet defined by 3 vertices of the polymesh.
Exceptions
Exception | Condition
ArgumentException |  The given value is not a valid index of a facet of the polymesh. A valid value is not negative and is smaller than the number of facets in the polymesh.
See Also
Reference
PolymeshTopology Class
Autodesk.Revit.DB Namespace